test/tests/fixed-point/flow_over_heated_plate/fluid-openfoam/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    slip-bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}
